
******** Test-0 ********
spawn java -jar CSdict.jar
NOTE: Picked up JDK_JAVA_OPTIONS: -Xmx500m
csdict> open test.dict.org 2628
csdict> dict
gcide "The Collaborative International Dictionary of English v.0.48"
wn "WordNet (r) 3.0 (2006)"
moby-thesaurus "Moby Thesaurus II by Grady Ward, 1.0"
elements "The Elements (07Nov00)"
vera "V.E.R.A. -- Virtual Entity of Relevant Acronyms (February 2016)"
jargon "The Jargon File (version 4.4.7, 29 Dec 2003)"
foldoc "The Free On-line Dictionary of Computing (30 December 2018)"
easton "Easton's 1897 Bible Dictionary"
hitchcock "Hitchcock's Bible Names Dictionary (late 1800's)"
bouvier "Bouvier's Law Dictionary, Revised 6th Ed (1856)"
devil "The Devil's Dictionary (1881-1906)"
world02 "CIA World Factbook 2002"
gaz2k-counties "U.S. Gazetteer Counties (2000)"
gaz2k-places "U.S. Gazetteer Places (2000)"
gaz2k-zips "U.S. Gazetteer Zip Code Tabulation Areas (2000)"
fd-hrv-eng "Croatian-English FreeDict Dictionary ver. 0.1.2"
fd-fin-por "suomi-português FreeDict+WikDict dictionary ver. 2018.09.13"
fd-fin-bul "suomi-български език FreeDict+WikDict dictionary ver. 2018.09.13"
fd-fra-bul "français-български език FreeDict+WikDict dictionary ver. 2018.09.13"
fd-deu-swe "Deutsch-Svenska FreeDict+WikDict dictionary ver. 2018.09.13"
fd-fin-swe "suomi-Svenska FreeDict+WikDict dictionary ver. 2018.09.13"
fd-jpn-rus "Japanese-Russian FreeDict Dictionary ver. 0.1"
fd-wol-fra "Wolof - French FreeDict dictionary ver. 0.1"
fd-fra-pol "français-język polski FreeDict+WikDict dictionary ver. 2018.09.13"
fd-eng-deu "English-German FreeDict Dictionary ver. 0.3.7"
fd-deu-nld "German-Dutch FreeDict Dictionary ver. 0.1.4"
fd-por-eng "Portuguese-English FreeDict Dictionary ver. 0.2"
fd-spa-deu "Spanish-German FreeDict Dictionary ver. 0.1"
fd-ces-eng "Czech-English FreeDict Dictionary ver. 0.2.3"
fd-swe-fin "Svenska-suomi FreeDict+WikDict dictionary ver. 2018.09.13"
fd-eng-pol "English - Polish Piotrowski+Saloni/FreeDict dictionary ver. 0.2"
fd-pol-nor "język polski-Norsk FreeDict+WikDict dictionary ver. 2018.09.13"
fd-eng-rom "English-Romanian FreeDict Dictionary ver. 0.6.3"
fd-eng-fra "English-French FreeDict Dictionary ver. 0.1.6"
fd-fin-ell "suomi-ελληνικά FreeDict+WikDict dictionary ver. 2018.09.13"
fd-eng-lit "English-Lithuanian FreeDict Dictionary ver. 0.7.2"
fd-ckb-kmr "Sorani-Kurmanji Ferheng/FreeDict Dictionary ver. 0.2"
fd-ita-eng "Italian-English FreeDict Dictionary ver. 0.2"
fd-pol-eng "język polski-English FreeDict+WikDict dictionary ver. 2018.09.13"
fd-gle-eng "Irish-English FreeDict Dictionary ver. 0.2"
fd-eng-tur "English-Turkish FreeDict Dictionary ver. 0.3"
fd-gle-pol "Irish-Polish FreeDict Dictionary ver. 0.1.2"
fd-pol-deu "język polski-Deutsch FreeDict+WikDict dictionary ver. 2018.09.13"
fd-fra-spa "français-español FreeDict+WikDict dictionary ver. 2018.09.13"
fd-lit-eng "Lithuanian-English FreeDict Dictionary ver. 0.7.2"
fd-eng-jpn "English-日本語 (にほんご) FreeDict+WikDict dictionary ver. 2018.09.13"
fd-ara-eng "Arabic-English FreeDict Dictionary ver. 0.6.3"
fd-nld-ita "Nederlands-italiano FreeDict+WikDict dictionary ver. 2018.09.13"
fd-eng-lat "English-Latin FreeDict Dictionary ver. 0.1.2"
fd-eng-hun "English-Hungarian FreeDict Dictionary ver. 0.2.1"
fd-ita-jpn "italiano-日本語 (にほんご) FreeDict+WikDict dictionary ver. 2018.09.13"
fd-dan-eng "Danish-English FreeDict Dictionary ver. 0.2.2"
fd-hun-eng "Hungarian-English FreeDict Dictionary ver. 0.4.1"
fd-pol-gle "Polish-Irish FreeDict Dictionary ver. 0.1.2"
fd-fra-fin "français-suomi FreeDict+WikDict dictionary ver. 2018.09.13"
fd-nld-swe "Nederlands-Svenska FreeDict+WikDict dictionary ver. 2018.09.13"
fd-nld-eng "Dutch-English Freedict Dictionary ver. 0.2"
fd-deu-kur "German-Kurdish Ferheng/FreeDict Dictionary ver. 0.2.2"
fd-deu-spa "Deutsch-español FreeDict+WikDict dictionary ver. 2018.09.13"
fd-eng-afr "English-Afrikaans FreeDict Dictionary ver. 0.1.3"
fd-eng-swe "English-Swedish FreeDict Dictionary ver. 0.2"
fd-jpn-deu "Japanese-German FreeDict Dictionary ver. 0.2.0"
fd-epo-eng "Esperanto-English FreeDict dictionary ver. 1.0.1"
fd-pol-nld "język polski-Nederlands FreeDict+WikDict dictionary ver. 2018.09.13"
fd-lat-deu "Lateinisch-Deutsch FreeDict-Wörterbuch ver. 1.0.3"
fd-eng-cym "Eurfa Saesneg, English-Welsh Eurfa/Freedict dictionary ver. 0.2.3"
fd-por-spa "português-español FreeDict+WikDict dictionary ver. 2018.09.13"
fd-eng-spa "English-Spanish FreeDict Dictionary ver. 0.3"
fd-swe-tur "Svenska-Türkçe FreeDict+WikDict dictionary ver. 2018.09.13"
fd-tur-eng "Turkish-English FreeDict Dictionary ver. 0.3"
fd-tur-deu "Turkish-German FreeDict Dictionary ver. 0.2"
fd-pol-fra "język polski-français FreeDict+WikDict dictionary ver. 2018.09.13"
fd-eng-por "English-Portuguese FreeDict Dictionary ver. 0.3"
fd-ita-pol "italiano-język polski FreeDict+WikDict dictionary ver. 2018.09.13"
fd-eng-ces "English-Czech dicts.info/FreeDict Dictionary ver. 0.1.3"
fd-deu-tur "German-Turkish Ferheng/FreeDict Dictionary ver. 0.2.2"
fd-fra-jpn "français-日本語 (にほんご) FreeDict+WikDict dictionary ver. 2018.09.13"
fd-cym-eng "Eurfa Cymraeg, Welsh-English Eurfa/Freedict dictionary ver. 0.2.3"
fd-bre-fra "Breton-French FreeDict Dictionary (Geriadur Tomaz) ver. 0.8.3"
fd-jpn-fra "Japanese-French FreeDict Dictionary ver. 0.1"
fd-nld-deu "Dutch-German FreeDict Dictionary ver. 0.2"
fd-eng-nld "English-Dutch FreeDict Dictionary ver. 0.2"
fd-deu-por "German-Portuguese FreeDict Dictionary ver. 0.2.2"
fd-eng-hrv "English-Croatian FreeDict Dictionary ver. 0.2.2"
fd-mkd-bul "Macedonian - Bulgarian FreeDict Dictionary ver. 0.1.1"
fd-swe-eng "Swedish-English FreeDict Dictionary ver. 0.2"
fd-pol-spa "język polski-español FreeDict+WikDict dictionary ver. 2018.09.13"
fd-jpn-eng "Japanese-English FreeDict Dictionary ver. 0.1"
fd-eng-ell "English - Modern Greek XDXF/FreeDict dictionary ver. 0.1.1"
fd-ita-por "italiano-português FreeDict+WikDict dictionary ver. 2018.09.13"
fd-pol-swe "język polski-Svenska FreeDict+WikDict dictionary ver. 2018.09.13"
fd-pol-fin "język polski-suomi FreeDict+WikDict dictionary ver. 2018.09.13"
fd-kur-tur "Kurdish-Turkish Ferheng/FreeDict Dictionary ver. 0.1.2"
fd-ita-swe "italiano-Svenska FreeDict+WikDict dictionary ver. 2018.09.13"
fd-eng-swh "English-Swahili xFried/FreeDict Dictionary ver. 0.2.2"
fd-kha-eng "Khasi-English FreeDict Dictionary ver. 0.2.2"
fd-fin-eng "suomi-English FreeDict+WikDict dictionary ver. 2018.09.13"
fd-eng-hin "English-Hindi FreeDict Dictionary ver. 1.6"
fd-spa-eng "Spanish-English FreeDict Dictionary ver. 0.3"
fd-afr-eng "Afrikaans-English FreeDict Dictionary ver. 0.2.2"
fd-ita-fin "italiano-suomi FreeDict+WikDict dictionary ver. 2018.09.13"
fd-eng-fin "English-suomi FreeDict+WikDict dictionary ver. 2018.09.13"
fd-fra-ita "français-italiano FreeDict+WikDict dictionary ver. 2018.09.13"
fd-deu-rus "Deutsch-Русский FreeDict+WikDict dictionary ver. 2018.09.13"
fd-deu-bul "Deutsch-български език FreeDict+WikDict dictionary ver. 2018.09.13"
fd-deu-pol "Deutsch-język polski FreeDict+WikDict dictionary ver. 2018.09.13"
fd-srp-eng "Serbian - English FreeDict Dictionary ver. 0.2"
fd-kur-deu "Kurdish-German Ferheng/FreeDict Dictionary ver. 0.1.2"
fd-spa-por "Spanish-Portuguese FreeDict Dictionary ver. 0.2.1"
fd-swe-pol "Svenska-język polski FreeDict+WikDict dictionary ver. 2018.09.13"
fd-swe-rus "Svenska-Русский FreeDict+WikDict dictionary ver. 2018.09.13"
fd-nld-spa "Nederlands-español FreeDict+WikDict dictionary ver. 2018.09.13"
fd-swh-pol "Swahili-Polish SSSP/FreeDict Dictionary ver. 0.2.3"
fd-oci-cat "Lenga d'òc - Català FreeDict Dictionary ver. 0.1.1"
fd-ita-rus "italiano-Русский FreeDict+WikDict dictionary ver. 2018.09.13"
fd-fra-ell "français-ελληνικά FreeDict+WikDict dictionary ver. 2018.09.13"
fd-eng-srp "English-Serbian FreeDict Dictionary ver. 0.1.3"
fd-fra-tur "français-Türkçe FreeDict+WikDict dictionary ver. 2018.09.13"
fd-fra-eng "French-English FreeDict Dictionary ver. 0.4.1"
fd-ita-ell "italiano-ελληνικά FreeDict+WikDict dictionary ver. 2018.09.13"
fd-kur-eng "Kurdish-English Ferheng/FreeDict Dictionary ver. 1.2"
fd-swe-deu "Svenska-Deutsch FreeDict+WikDict dictionary ver. 2018.09.13"
fd-swe-fra "Svenska-français FreeDict+WikDict dictionary ver. 2018.09.13"
fd-swe-lat "Svenska-latine FreeDict+WikDict dictionary ver. 2018.09.13"
fd-swe-ell "Svenska-ελληνικά FreeDict+WikDict dictionary ver. 2018.09.13"
fd-eng-rus "English-Russian FreeDict Dictionary ver. 0.3.1"
fd-pol-por "język polski-português FreeDict+WikDict dictionary ver. 2018.09.13"
fd-gla-deu "Scottish Gaelic-German FreeDict Dictionary ver. 0.2"
fd-eng-ita "English-Italian FreeDict Dictionary ver. 0.1.2"
fd-pol-ita "język polski-italiano FreeDict+WikDict dictionary ver. 2018.09.13"
fd-fra-swe "français-Svenska FreeDict+WikDict dictionary ver. 2018.09.13"
fd-isl-eng "íslenska - English FreeDict Dictionary ver. 0.1.1"
fd-swe-spa "Svenska-español FreeDict+WikDict dictionary ver. 2018.09.13"
fd-nno-nob "Norwegian Nynorsk-Norwegian Bokmål FreeDict Dictionary ver. 0.1.1"
fd-swe-ita "Svenska-italiano FreeDict+WikDict dictionary ver. 2018.09.13"
fd-fra-deu "français-Deutsch FreeDict+WikDict dictionary ver. 2018.09.13"
fd-fin-ita "suomi-italiano FreeDict+WikDict dictionary ver. 2018.09.13"
fd-nld-fra "Nederlands-French FreeDict Dictionary ver. 0.2"
fd-eng-ara "English-Arabic FreeDict Dictionary ver. 0.6.3"
fd-slk-eng "Slovak-English FreeDict Dictionary ver. 0.2.1"
fd-fra-por "français-português FreeDict+WikDict dictionary ver. 2018.09.13"
fd-spa-ast "Spanish - Asturian FreeDict Dictionary ver. 0.1.1"
fd-fin-jpn "suomi-日本語 (にほんご) FreeDict+WikDict dictionary ver. 2018.09.13"
fd-deu-ita "German-Italian FreeDict Dictionary ver. 0.2"
fd-swh-eng "Swahili-English xFried/FreeDict Dictionary ver. 0.4.4"
fd-fin-nor "suomi-Norsk FreeDict+WikDict dictionary ver. 2018.09.13"
fd-fra-nld "French-Dutch FreeDict Dictionary ver. 0.2"
fd-lat-eng "Latin-English FreeDict Dictionary ver. 0.1.2"
fd-eng-bul "English-български език FreeDict+WikDict dictionary ver. 2018.09.13"
fd-deu-fra "Deutsch-français FreeDict+WikDict dictionary ver. 2018.09.13"
fd-swe-bul "Svenska-български език FreeDict+WikDict dictionary ver. 2018.09.13"
fd-deu-eng "German-English FreeDict Dictionary ver. 0.3.5"
fd-pol-rus "język polski-Русский FreeDict+WikDict dictionary ver. 2018.09.13"
fd-ita-deu "Italian-German FreeDict Dictionary ver. 0.2"
fd-eng-gle "English-Irish FreeDict Dictionary ver. 0.3.2"
fd-swe-por "Svenska-português FreeDict+WikDict dictionary ver. 2018.09.13"
fd-afr-deu "Afrikaans-German FreeDict Dictionary ver. 0.3.2"
fd-por-deu "Portuguese-German FreeDict Dictionary ver. 0.2"
fd-fra-bre "French-Breton FreeDict Dictionary (Geriadur Tomaz) ver. 0.2.7"
fd-san-deu "Sanskrit-German FreeDict Dictionary ver. 0.2.2"
fd-kha-deu "Khasi - German FreeDict Dictionary ver. 0.1.3"
fd-fra-rus "français-Русский FreeDict+WikDict dictionary ver. 2018.09.13"
fd-pol-ell "język polski-ελληνικά FreeDict+WikDict dictionary ver. 2018.09.13"
english "English Monolingual Dictionaries"
trans "Translating Dictionaries"
all "All Dictionaries (English-Only and Translating)"
.
csdict> 
******** Test-1 ********
spawn java -jar CSdict.jar
NOTE: Picked up JDK_JAVA_OPTIONS: -Xmx500m
csdict> open test.dict.org 2628
csdict> prefixmatch Corinthians
easton "Corinthians, First Epistle to the"
easton "Corinthians, Second Epistle to the"
.
csdict> set devil
csdict> prefixmatch Corinthians
****No matching word(s) found****
csdict> 
******** Test-2 ********
spawn java -jar CSdict.jar
NOTE: Picked up JDK_JAVA_OPTIONS: -Xmx500m
csdict> open test.dict.org 2628
csdict> match maple
gcide "Maple"
wn "maple"
foldoc "maple"
.
csdict> match maples
****No matching word(s) found****
csdict> quit

******** Test-3 ********
spawn java -jar CSdict.jar
NOTE: Picked up JDK_JAVA_OPTIONS: -Xmx500m
csdict> open test.dict.org 2628
csdict> define orca
@ gcide "The Collaborative International Dictionary of English v.0.48"
Orca \Or"ca\ ([^o]r"k[.a]), prop. n.
   The {killer whale} ({Orcinus orca}).
   [PJC]
.
@ wn "WordNet (r) 3.0 (2006)"
orca
    n 1: predatory black-and-white toothed whale with large dorsal
         fin; common in cold seas [syn: {killer whale}, {killer},
         {orca}, {grampus}, {sea wolf}, {Orcinus orca}]
.
@ vera "V.E.R.A. -- Virtual Entity of Relevant Acronyms (February 2016)"
ORCA
       Online Resource Control Aid
       
.
@ foldoc "The Free On-line Dictionary of Computing (30 December 2018)"
Orca

   Vrije Universiteit, Amsterdam, 1986.  Similar to Modula-2, but
   with support for distributed programming using shared data
   objects, like Linda.  A 'graph' data type removes the need for
   pointers.  Version for the Amoeba OS, comes with Amoeba.
   "Orca: A Language for Distributed Processing", H.E.  Bal
   <bal@cs.vu.nl> et al, SIGPLAN Notices 25(5):17-24 (May 1990).

.
@ fd-deu-fra "Deutsch-français FreeDict+WikDict dictionary ver. 2018.09.13"
Orca /ˈɔɾkɑː/ <n, masc>
 [Zoologie: ein Vertreter der Delphine (Delphinidae), der sich vor allem durch seine fast mannshohe sichel- oder schwertförmige gebogene Rückenflosse auszeichnet, die ihm den deutschen Namen Schwertwal eingebracht wird] orque, épaulard
.
@ fd-deu-rus "Deutsch-Русский FreeDict+WikDict dictionary ver. 2018.09.13"
Orca /ˈɔɾkɑː/ <n, masc>
 [Zoologie: ein Vertreter der Delphine (Delphinidae), der sich vor allem durch seine fast mannshohe sichel- oder schwertförmige gebogene Rückenflosse auszeichnet, die ihm den deutschen Namen Schwertwal eingebracht wird] косатка
.
@ fd-deu-swe "Deutsch-Svenska FreeDict+WikDict dictionary ver. 2018.09.13"
Orca /ˈɔɾkɑː/ <n, masc>
 [Zoologie: ein Vertreter der Delphine (Delphinidae), der sich vor allem durch seine fast mannshohe sichel- oder schwertförmige gebogene Rückenflosse auszeichnet, die ihm den deutschen Namen Schwertwal eingebracht wird] späckhuggare
.
@ fd-eng-bul "English-български език FreeDict+WikDict dictionary ver. 2018.09.13"
orca //ˈɔɹkə// //ˈɔː(ɹ).kə// <n>
 [Orcinus orca] коса́тка
.
@ fd-eng-ces "English-Czech dicts.info/FreeDict Dictionary ver. 0.1.3"
orca /ˈɔːkə/ <n>
kosatka
.
@ fd-eng-fin "English-suomi FreeDict+WikDict dictionary ver. 2018.09.13"
orca //ˈɔɹkə// //ˈɔː(ɹ).kə// <n>
 [Orcinus orca] miekkavalas
.
@ fd-eng-jpn "English-日本語 (にほんご) FreeDict+WikDict dictionary ver. 2018.09.13"
orca //ˈɔɹkə// //ˈɔː(ɹ).kə// <n>
 [Orcinus orca] さかまた, 鯱
.
@ fd-hun-eng "Hungarian-English FreeDict Dictionary ver. 0.4.1"
orca /ˈortsɑ/
1. cheeks
2. jowl
3. cheek
.
@ fd-ita-ell "italiano-ελληνικά FreeDict+WikDict dictionary ver. 2018.09.13"
orca /ˈorka/ <n>
όρκα
.
@ fd-ita-fin "italiano-suomi FreeDict+WikDict dictionary ver. 2018.09.13"
orca /ˈorka/ <n>
miekkavalas
.
@ fd-ita-jpn "italiano-日本語 (にほんご) FreeDict+WikDict dictionary ver. 2018.09.13"
orca /ˈorka/ <n>
シャチ
.
@ fd-ita-pol "italiano-język polski FreeDict+WikDict dictionary ver. 2018.09.13"
orca /ˈorka/ <n>
miecznik, orka
.
@ fd-ita-por "italiano-português FreeDict+WikDict dictionary ver. 2018.09.13"
orca /ˈorka/ <n>
orca
.
@ fd-ita-rus "italiano-Русский FreeDict+WikDict dictionary ver. 2018.09.13"
orca /ˈorka/ <n>
косатка
.
@ fd-ita-swe "italiano-Svenska FreeDict+WikDict dictionary ver. 2018.09.13"
orca /ˈorka/ <n>
späckhuggare
.
@ fd-por-spa "português-español FreeDict+WikDict dictionary ver. 2018.09.13"
orca /ˈɔɾəkɐ/ <n>
orca
.
@ fd-spa-ast "Spanish - Asturian FreeDict Dictionary ver. 0.1.1"
orca /ˈoɾka/
orca  <n>
.
@ fd-spa-deu "Spanish-German FreeDict Dictionary ver. 0.1"
orca /ˈoɾka/ <n, f>
Killerwal <n, m>
.
csdict> 
******** Test-4 ********
spawn java -jar CSdict.jar
NOTE: Picked up JDK_JAVA_OPTIONS: -Xmx500m
csdict> open test.dict.org 2628
csdict> defn ine orcas
****No definition found****
****No matches found****
csdict> 
******** Test-5 ********
spawn java -jar CSdict.jar
NOTE: Picked up JDK_JAVA_OPTIONS: -Xmx500m
csdict> open test.dict.org 2628
csdict> define orcass
****No definition found****
****No matches found****
csdict> 
******** Test-6 ********
spawn java -jar CSdict.jar
NOTE: Picked up JDK_JAVA_OPTIONS: -Xmx500m
csdict> open test.dict.org 2628 77
901 Incorrect number of arguments.
csdict> open tes. t.dict.r org 2628
csdict> open test.dict.org 2628
csdict> 
******** Test-7 ********
spawn java -jar CSdict.jar
NOTE: Picked up JDK_JAVA_OPTIONS: -Xmx500m
csdict> open test.dict.org 2628^[[D^[[D          ^[[D^[[D             2628
csdict> #  heyyo
900 Invalid command.
csdict> 
******** Test-8 ********
spawn java -jar CSdict.jar
NOTE: Picked up JDK_JAVA_OPTIONS: -Xmx500m
csdict> open test.dict.org 2628
csdict> 900 Invalid command.
csdict> 
******** Test-9 ********
spawn java -jar CSdict.jar
NOTE: Picked up JDK_JAVA_OPTIONS: -Xmx500m
csdict> open test.dict.org nonnumber
902 Invalid argument.
csdict> open test.dict.org 2628
csdict> close
csdict> open 199.48.130.6 2628
csdict> quit

******** Test-10 ********
spawn java -jar CSdict.jar -e
extra characters after close-quote
    while executing
"expect -exact "NOTE: Picked up JDK_JAVA_OPTIONS: -Xmx500m\r
997 Invalid command line option - Only -d is allowed"\"
    (file "/cs/csbox/cs-317/2022W1/a1/a1-dictionary-automarker/automarker/tests/script_error_997.exp" line 47)

******** Test-11 ********
spawn java -jar CSdict.jar -d -e
extra characters after close-quote
    while executing
"expect -exact "NOTE: Picked up JDK_JAVA_OPTIONS: -Xmx500m
996 Too many command line options - Only -d is allowed"\"
    (file "/cs/csbox/cs-317/2022W1/a1/a1-dictionary-automarker/automarker/tests/script_error_996.exp" line 47)
